config/cf/Enums/ВидДокументаУчетДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидДокументаУчетДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаработнаяПлата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидДокументаУчетДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мВидыОпераций	= Перечисления.ВидДокументаУчетДенежныхСредств;
	мВидОперации	= Неопределено;
	
	Если Параметры.Отбор.Свойство("ВидДвиженияДенежныхСредств", мВидОперации) Тогда
		Если мВидОперации = Перечисления.ВидыДоходовРасходов.Доход Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мВидыОпераций.ОплатаПокупателя);			
			ДанныеВыбора.Добавить(мВидыОпераций.ВозвратПоставщика);
			ДанныеВыбора.Добавить(мВидыОпераций.ПрочийДоход);
		ИначеЕсли мВидОперации = Перечисления.ВидыДоходовРасходов.Расход Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мВидыОпераций.ВозвратПокупателю);
			ДанныеВыбора.Добавить(мВидыОпераций.ЗаработнаяПлата);
			ДанныеВыбора.Добавить(мВидыОпераций.ОплатаПоставщику);
			ДанныеВыбора.Добавить(мВидыОпераций.ПрочийРасход);
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
